jbondar/binaris-nanod/firmware/sdkconfig.defaults
# NanoD ESP32-S3 configuration
CONFIG_IDF_TARGET="esp32s3"

# Flash: 4MB QIO 80MHz
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

# PSRAM
CONFIG_ESP32S3_SPIRAM_SUPPORT=y
CONFIG_SPIRAM=y

# CPU: 240MHz
CONFIG_ESP_DEFAULT_CPU_FREQ_240=y

# Watchdog
CONFIG_ESP_TASK_WDT_TIMEOUT_S=10

# USB CDC on boot (for serial output)
# Phase 3B will switch to TinyUSB composite (CDC+HID+MIDI) — requires device for testing
CONFIG_ESP_CONSOLE_USB_CDC=y

# MCPWM (motor control PWM)
CONFIG_SOC_MCPWM_SUPPORTED=y

# Partition table — use default single factory, no OTA
CONFIG_PARTITION_TABLE_SINGLE_APP=y
